zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/include/pio/pic32ck1012gc01048.h
#define PIN_PC07H_CAN0_RX                          _UINT32_(71)
#define MUX_PC07H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC07H_CAN0_RX                       ((PIN_PC07H_CAN0_RX << 16) | MUX_PC07H_CAN0_RX)
#define PORT_PC07H_CAN0_RX                         (_UINT32_(1) << 7)

#define PIN_PB00H_CAN0_TX                          _UINT32_(32)
#define MUX_PB00H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB00H_CAN0_TX                       ((PIN_PB00H_CAN0_TX << 16) | MUX_PB00H_CAN0_TX)
#define PORT_PB00H_CAN0_TX                         (_UINT32_(1) << 0)

#define PIN_PC02H_CAN0_TX                          _UINT32_(66)
#define MUX_PC02H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC02H_CAN0_TX                       ((PIN_PC02H_CAN0_TX << 16) | MUX_PC02H_CAN0_TX)
#define PORT_PC02H_CAN0_TX                         (_UINT32_(1) << 2)

#define PIN_PC06H_CAN0_TX                          _UINT32_(70)
#define MUX_PC06H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN0_TX                       ((PIN_PC06H_CAN0_TX << 16) | MUX_PC06H_CAN0_TX)
#define PORT_PC06H_CAN0_TX                         (_UINT32_(1) << 6)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PB02M_CCL_IN0                          _UINT32_(34)
#define MUX_PB02M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB02M_CCL_IN0                       ((PIN_PB02M_CCL_IN0 << 16) | MUX_PB02M_CCL_IN0)
#define PORT_PB02M_CCL_IN0                         (_UINT32_(1) << 2)

#define PIN_PB03M_CCL_IN1                          _UINT32_(35)
#define MUX_PB03M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB03M_CCL_IN1                       ((PIN_PB03M_CCL_IN1 << 16) | MUX_PB03M_CCL_IN1)
#define PORT_PB03M_CCL_IN1                         (_UINT32_(1) << 3)

#define PIN_PD02M_CCL_IN2                          _UINT32_(98)
#define MUX_PD02M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PD02M_CCL_IN2                       ((PIN_PD02M_CCL_IN2 << 16) | MUX_PD02M_CCL_IN2)
#define PORT_PD02M_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC06M_CCL_IN5                          _UINT32_(70)
#define MUX_PC06M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC06M_CCL_IN5                       ((PIN_PC06M_CCL_IN5 << 16) | MUX_PC06M_CCL_IN5)
#define PORT_PC06M_CCL_IN5                         (_UINT32_(1) << 6)

#define PIN_PB00M_CCL_IN6                          _UINT32_(32)
#define MUX_PB00M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PB00M_CCL_IN6                       ((PIN_PB00M_CCL_IN6 << 16) | MUX_PB00M_CCL_IN6)
#define PORT_PB00M_CCL_IN6                         (_UINT32_(1) << 0)

#define PIN_PB01M_CCL_IN7                          _UINT32_(33)
#define MUX_PB01M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PB01M_CCL_IN7                       ((PIN_PB01M_CCL_IN7 << 16) | MUX_PB01M_CCL_IN7)
#define PORT_PB01M_CCL_IN7                         (_UINT32_(1) << 1)

#define PIN_PB04M_CCL_IN8                          _UINT32_(36)
#define MUX_PB04M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PB04M_CCL_IN8                       ((PIN_PB04M_CCL_IN8 << 16) | MUX_PB04M_CCL_IN8)
#define PORT_PB04M_CCL_IN8                         (_UINT32_(1) << 4)

#define PIN_PA06M_CCL_IN11                         _UINT32_(6) 
#define MUX_PA06M_CCL_IN11                         _UINT32_(12)
#define PINMUX_PA06M_CCL_IN11                      ((PIN_PA06M_CCL_IN11 << 16) | MUX_PA06M_CCL_IN11)
#define PORT_PA06M_CCL_IN11                        (_UINT32_(1) << 6)

#define PIN_PB06M_CCL_OUT0                         _UINT32_(38)
#define MUX_PB06M_CCL_OUT0                         _UINT32_(12)
#define PINMUX_PB06M_CCL_OUT0                      ((PIN_PB06M_CCL_OUT0 << 16) | MUX_PB06M_CCL_OUT0)
#define PORT_PB06M_CCL_OUT0                        (_UINT32_(1) << 6)

#define PIN_PA00M_CCL_OUT1                         _UINT32_(0) 
#define MUX_PA00M_CCL_OUT1                         _UINT32_(12)
#define PINMUX_PA00M_CCL_OUT1                      ((PIN_PA00M_CCL_OUT1 << 16) | MUX_PA00M_CCL_OUT1)
#define PORT_PA00M_CCL_OUT1                        (_UINT32_(1) << 0)

#define PIN_PC07M_CCL_OUT2                         _UINT32_(71)
#define MUX_PC07M_CCL_OUT2                         _UINT32_(12)
#define PINMUX_PC07M_CCL_OUT2                      ((PIN_PC07M_CCL_OUT2 << 16) | MUX_PC07M_CCL_OUT2)
#define PORT_PC07M_CCL_OUT2                        (_UINT32_(1) << 7)

#define PIN_PA07M_CCL_OUT3                         _UINT32_(7) 
#define MUX_PA07M_CCL_OUT3                         _UINT32_(12)
#define PINMUX_PA07M_CCL_OUT3                      ((PIN_PA07M_CCL_OUT3 << 16) | MUX_PA07M_CCL_OUT3)
#define PORT_PA07M_CCL_OUT3                        (_UINT32_(1) << 7)

#define PIN_PB05M_CCL_OUT3                         _UINT32_(37)
#define MUX_PB05M_CCL_OUT3                         _UINT32_(12)
#define PINMUX_PB05M_CCL_OUT3                      ((PIN_PB05M_CCL_OUT3 << 16) | MUX_PB05M_CCL_OUT3)
#define PORT_PB05M_CCL_OUT3                        (_UINT32_(1) << 5)

/* =================== PORT definition for EIC peripheral =================== */
#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PD00A_EIC_EXTINT0                      _UINT32_(96)
#define MUX_PD00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD00A_EIC_EXTINT0                   ((PIN_PD00A_EIC_EXTINT0 << 16) | MUX_PD00A_EIC_EXTINT0)
#define PORT_PD00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PD00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD00 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

