zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/include/pio/pic32ck1012gc01048.h
#define PIN_PC07L_ETH_RXD0                         _UINT32_(71)
#define MUX_PC07L_ETH_RXD0                         _UINT32_(11)
#define PINMUX_PC07L_ETH_RXD0                      ((PIN_PC07L_ETH_RXD0 << 16) | MUX_PC07L_ETH_RXD0)
#define PORT_PC07L_ETH_RXD0                        (_UINT32_(1) << 7)

#define PIN_PC01O_ETH_RXD1                         _UINT32_(65)
#define MUX_PC01O_ETH_RXD1                         _UINT32_(14)
#define PINMUX_PC01O_ETH_RXD1                      ((PIN_PC01O_ETH_RXD1 << 16) | MUX_PC01O_ETH_RXD1)
#define PORT_PC01O_ETH_RXD1                        (_UINT32_(1) << 1)

#define PIN_PC06L_ETH_RXD1                         _UINT32_(70)
#define MUX_PC06L_ETH_RXD1                         _UINT32_(11)
#define PINMUX_PC06L_ETH_RXD1                      ((PIN_PC06L_ETH_RXD1 << 16) | MUX_PC06L_ETH_RXD1)
#define PORT_PC06L_ETH_RXD1                        (_UINT32_(1) << 6)

#define PIN_PC05L_ETH_RXD2                         _UINT32_(69)
#define MUX_PC05L_ETH_RXD2                         _UINT32_(11)
#define PINMUX_PC05L_ETH_RXD2                      ((PIN_PC05L_ETH_RXD2 << 16) | MUX_PC05L_ETH_RXD2)
#define PORT_PC05L_ETH_RXD2                        (_UINT32_(1) << 5)

#define PIN_PC10O_ETH_RXDV                         _UINT32_(74)
#define MUX_PC10O_ETH_RXDV                         _UINT32_(14)
#define PINMUX_PC10O_ETH_RXDV                      ((PIN_PC10O_ETH_RXDV << 16) | MUX_PC10O_ETH_RXDV)
#define PORT_PC10O_ETH_RXDV                        (_UINT32_(1) << 10)

#define PIN_PC10L_ETH_RXDV                         _UINT32_(74)
#define MUX_PC10L_ETH_RXDV                         _UINT32_(11)
#define PINMUX_PC10L_ETH_RXDV                      ((PIN_PC10L_ETH_RXDV << 16) | MUX_PC10L_ETH_RXDV)
#define PORT_PC10L_ETH_RXDV                        (_UINT32_(1) << 10)

#define PIN_PC03O_ETH_RXER                         _UINT32_(67)
#define MUX_PC03O_ETH_RXER                         _UINT32_(14)
#define PINMUX_PC03O_ETH_RXER                      ((PIN_PC03O_ETH_RXER << 16) | MUX_PC03O_ETH_RXER)
#define PORT_PC03O_ETH_RXER                        (_UINT32_(1) << 3)

#define PIN_PD02O_ETH_TSUCOMP                      _UINT32_(98)
#define MUX_PD02O_ETH_TSUCOMP                      _UINT32_(14)
#define PINMUX_PD02O_ETH_TSUCOMP                   ((PIN_PD02O_ETH_TSUCOMP << 16) | MUX_PD02O_ETH_TSUCOMP)
#define PORT_PD02O_ETH_TSUCOMP                     (_UINT32_(1) << 2)

#define PIN_PD02L_ETH_TSUCOMP                      _UINT32_(98)
#define MUX_PD02L_ETH_TSUCOMP                      _UINT32_(11)
#define PINMUX_PD02L_ETH_TSUCOMP                   ((PIN_PD02L_ETH_TSUCOMP << 16) | MUX_PD02L_ETH_TSUCOMP)
#define PORT_PD02L_ETH_TSUCOMP                     (_UINT32_(1) << 2)

#define PIN_PC06O_ETH_TXD0                         _UINT32_(70)
#define MUX_PC06O_ETH_TXD0                         _UINT32_(14)
#define PINMUX_PC06O_ETH_TXD0                      ((PIN_PC06O_ETH_TXD0 << 16) | MUX_PC06O_ETH_TXD0)
#define PORT_PC06O_ETH_TXD0                        (_UINT32_(1) << 6)

#define PIN_PC07O_ETH_TXD1                         _UINT32_(71)
#define MUX_PC07O_ETH_TXD1                         _UINT32_(14)
#define PINMUX_PC07O_ETH_TXD1                      ((PIN_PC07O_ETH_TXD1 << 16) | MUX_PC07O_ETH_TXD1)
#define PORT_PC07O_ETH_TXD1                        (_UINT32_(1) << 7)

#define PIN_PC05O_ETH_TXEN                         _UINT32_(69)
#define MUX_PC05O_ETH_TXEN                         _UINT32_(14)
#define PINMUX_PC05O_ETH_TXEN                      ((PIN_PC05O_ETH_TXEN << 16) | MUX_PC05O_ETH_TXEN)
#define PORT_PC05O_ETH_TXEN                        (_UINT32_(1) << 5)

#define PIN_PC11L_ETH_TXEN                         _UINT32_(75)
#define MUX_PC11L_ETH_TXEN                         _UINT32_(11)
#define PINMUX_PC11L_ETH_TXEN                      ((PIN_PC11L_ETH_TXEN << 16) | MUX_PC11L_ETH_TXEN)
#define PORT_PC11L_ETH_TXEN                        (_UINT32_(1) << 11)

#define PIN_PC00O_ETH_TX_CLK                       _UINT32_(64)
#define MUX_PC00O_ETH_TX_CLK                       _UINT32_(14)
#define PINMUX_PC00O_ETH_TX_CLK                    ((PIN_PC00O_ETH_TX_CLK << 16) | MUX_PC00O_ETH_TX_CLK)
#define PORT_PC00O_ETH_TX_CLK                      (_UINT32_(1) << 0)

#define PIN_PC00L_ETH_TX_CLK                       _UINT32_(64)
#define MUX_PC00L_ETH_TX_CLK                       _UINT32_(11)
#define PINMUX_PC00L_ETH_TX_CLK                    ((PIN_PC00L_ETH_TX_CLK << 16) | MUX_PC00L_ETH_TX_CLK)
#define PORT_PC00L_ETH_TX_CLK                      (_UINT32_(1) << 0)

/* ================== PORT definition for GCLK peripheral =================== */
#define PIN_PA09M_GCLK_IO0                         _UINT32_(9) 
#define MUX_PA09M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA09M_GCLK_IO0                      ((PIN_PA09M_GCLK_IO0 << 16) | MUX_PA09M_GCLK_IO0)
#define PORT_PA09M_GCLK_IO0                        (_UINT32_(1) << 9)

#define PIN_PA03M_GCLK_IO0                         _UINT32_(3) 
#define MUX_PA03M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA03M_GCLK_IO0                      ((PIN_PA03M_GCLK_IO0 << 16) | MUX_PA03M_GCLK_IO0)
#define PORT_PA03M_GCLK_IO0                        (_UINT32_(1) << 3)

#define PIN_PA01M_GCLK_IO1                         _UINT32_(1) 
#define MUX_PA01M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA01M_GCLK_IO1                      ((PIN_PA01M_GCLK_IO1 << 16) | MUX_PA01M_GCLK_IO1)
#define PORT_PA01M_GCLK_IO1                        (_UINT32_(1) << 1)

#define PIN_PA10M_GCLK_IO1                         _UINT32_(10)
#define MUX_PA10M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA10M_GCLK_IO1                      ((PIN_PA10M_GCLK_IO1 << 16) | MUX_PA10M_GCLK_IO1)
#define PORT_PA10M_GCLK_IO1                        (_UINT32_(1) << 10)

#define PIN_PC00M_GCLK_IO2                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO2                      ((PIN_PC00M_GCLK_IO2 << 16) | MUX_PC00M_GCLK_IO2)
#define PORT_PC00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PC01M_GCLK_IO3                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO3                      ((PIN_PC01M_GCLK_IO3 << 16) | MUX_PC01M_GCLK_IO3)
#define PORT_PC01M_GCLK_IO3                        (_UINT32_(1) << 1)

